{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "114843a9",
   "metadata": {},
   "source": [
    "### 1. Neo4j Aura DB 환경설정"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "e3122013",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv\n",
    "load_dotenv()\n",
    "\n",
    "from langchain_neo4j import Neo4jGraph\n",
    "\n",
    "graph = Neo4jGraph(\n",
    "    url = os.getenv(\"NEO4J_URI\"),\n",
    "    username = os.getenv(\"NEO4J_USERNAME\")\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "d089ebfc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "데이터베이스가 초기화 되었습니다.\n"
     ]
    }
   ],
   "source": [
    "def reset_database(graph):\n",
    "    \"\"\"데이터베이트 초기화 하기\"\"\"\n",
    "    # 모든 노드와 관계 삭제\n",
    "    graph.query(\"MATCH (n) DETACH DELETE n\")\n",
    "\n",
    "    # 모든 제약조건 삭제\n",
    "    constraints = graph.query(\"SHOW CONSTRAINTS\")\n",
    "    for constraint in constraints:\n",
    "        constraint_name = constraint.get(\"name\")\n",
    "        if constraint_name:\n",
    "            graph.query(f\"DROP CONSTRAINT {constraint_name}\")\n",
    "    \n",
    "    # 모든 인덱스 삭제\n",
    "    indexes = graph.query(\"SHOW INDEXES\")\n",
    "    for index in indexes : \n",
    "        index_name = index.get(\"name\")\n",
    "        index_type = index.get(\"type\")\n",
    "        if index_name and index_type != \"CONSTRAINT\":\n",
    "            graph.query(f\"DROP INDEX {index_name}\")\n",
    "    \n",
    "    print(\"데이터베이스가 초기화 되었습니다.\")\n",
    "\n",
    "#데이터베이스 초기화\n",
    "reset_database(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "bf7fb274",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 데이터 모델 정의\n",
    "cypher_query = \"\"\"\n",
    "// Person 노드 생성\n",
    "CREATE (p1:Person {name : '홍길동', age : 35, city : '부산'})\n",
    "CREATE (p2:Person {name : '김철수', age : 28, city : '수원'})\n",
    "CREATE (p3:Person {name : '이영희', age : 32, city : '구미'})\n",
    "CREATE (p4:Person {name : '권두현', age : 30, city : '구미'})\n",
    "CREATE (p5:Person {name : '서윤주', age : 30, city : '서울'})\n",
    "CREATE (p6:Person {name : '박규리', age : 27, city : '서울'}) \n",
    "CREATE (p7:Person {name : '변지민', age : 25, city : '서울'})\n",
    "CREATE (p8:Person {name : '김하경', age : 29, city : '수원'})\n",
    "\n",
    "// 관심분야 노드 생성\n",
    "CREATE (i1:Interest {name: '영화'})\n",
    "CREATE (i2:Interest {name: '강아지'})\n",
    "CREATE (i3:Interest {name: '고양이'})\n",
    "CREATE (i4:Interest {name: '뮤지컬'})\n",
    "CREATE (i5:Interest {name: '여행'})\n",
    "\n",
    "// 장소 노드 생성\n",
    "CREATE (l1: Location {name: '남산타워', city:'서울'})\n",
    "CREATE (l2: Location {name: '해운대', city:'부산'})\n",
    "CREATE (l3: Location {name: '광화문', city:'서울'})\n",
    "CREATE (l4: Location {name: '행궁동', city:'수원'})\n",
    "\n",
    "// KNOWS 관계 생성 (사람들 간의 친구 관계)\n",
    "CREATE (p1)-[:KNOWS {since:2010}]->(p2)\n",
    "CREATE (p1)-[:KNOWS {since:2015}]->(p3)\n",
    "CREATE (p1)-[:KNOWS {since:2012}]->(p7)\n",
    "CREATE (p2)-[:KNOWS {since:2018}]->(p6)\n",
    "CREATE (p3)-[:KNOWS {since:2017}]->(p4)\n",
    "CREATE (p3)-[:KNOWS {since:2020}]->(p5)\n",
    "CREATE (p4)-[:KNOWS {since:2024}]->(p5)\n",
    "CREATE (p6)-[:KNOWS {since:2024}]->(p8)\n",
    "CREATE (p7)-[:KNOWS {since:2014}]->(p3)\n",
    "CREATE (p7)-[:KNOWS {since:2024}]->(p8)\n",
    "\n",
    "// LIKES 관계 생성 (사람과 관심분야 간의 관계)\n",
    "CREATE (p1)-[:LIKES {rating:2}]->(i1)\n",
    "CREATE (p1)-[:LIKES {rating:1}]->(i5)\n",
    "CREATE (p2)-[:LIKES {rating:5}]->(i3)\n",
    "CREATE (p3)-[:LIKES {rating:4}]->(i2)\n",
    "CREATE (p3)-[:LIKES {rating:5}]->(i4)\n",
    "CREATE (p4)-[:LIKES {rating:3}]->(i1)\n",
    "CREATE (p4)-[:LIKES {rating:5}]->(p5)\n",
    "CREATE (p5)-[:LIKES {rating:3}]->(i2)\n",
    "CREATE (p6)-[:LIKES {rating:4}]->(i3)\n",
    "CREATE (p7)-[:LIKES {rating:5}]->(i4)\n",
    "CREATE (p8)-[:LIKES {rating:3}]->(i5)\n",
    "\n",
    "// VISITED 관계 생성 (사람과 장소 간의 관계)\n",
    "CREATE (p1)-[:VISITED {date: '2023-03-15', rating :4}]->(l1)\n",
    "CREATE (p1)-[:VISITED {date: '2024-05-20', rating :5}]->(l2)\n",
    "CREATE (p2)-[:VISITED {date: '2021-04-10', rating :3}]->(l2)\n",
    "CREATE (p3)-[:VISITED {date: '2025-06-05', rating :5}]->(l3)\n",
    "CREATE (p4)-[:VISITED {date: '2024-07-12', rating :4}]->(l4)\n",
    "CREATE (p4)-[:VISITED {date: '2023-02-28', rating :5}]->(l1)\n",
    "CREATE (p5)-[:VISITED {date: '2022-08-03', rating :4}]->(l3)\n",
    "CREATE (p6)-[:VISITED {date: '2025-01-17', rating :5}]->(l2)\n",
    "CREATE (p7)-[:VISITED {date: '2024-09-22', rating :3}]->(l1)\n",
    "CREATE (p8)-[:VISITED {date: '2023-10-08', rating :4}]->(l2)\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d8453412",
   "metadata": {},
   "source": [
    "### 2. 가변길이 경로 (Variable-length paths)\n",
    "* 가변 길이 경로는 관계의 길이를 가변적으로 지정할 수 있는 기능 입니다.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f2820d17",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'시작점': '홍길동', '관계': ['KNOWS(2012)'], '도착점': '변지민'},\n",
       " {'시작점': '홍길동', '관계': ['KNOWS(2012)', 'KNOWS(2024)'], '도착점': '김하경'},\n",
       " {'시작점': '홍길동', '관계': ['KNOWS(2012)', 'KNOWS(2014)'], '도착점': '이영희'},\n",
       " {'시작점': '홍길동',\n",
       "  '관계': ['KNOWS(2012)', 'KNOWS(2014)', 'KNOWS(2020)'],\n",
       "  '도착점': '서윤주'},\n",
       " {'시작점': '홍길동',\n",
       "  '관계': ['KNOWS(2012)', 'KNOWS(2014)', 'KNOWS(2017)'],\n",
       "  '도착점': '권두현'},\n",
       " {'시작점': '홍길동', '관계': ['KNOWS(2015)'], '도착점': '이영희'},\n",
       " {'시작점': '홍길동', '관계': ['KNOWS(2015)', 'KNOWS(2020)'], '도착점': '서윤주'},\n",
       " {'시작점': '홍길동', '관계': ['KNOWS(2015)', 'KNOWS(2017)'], '도착점': '권두현'},\n",
       " {'시작점': '홍길동',\n",
       "  '관계': ['KNOWS(2015)', 'KNOWS(2017)', 'KNOWS(2024)'],\n",
       "  '도착점': '서윤주'},\n",
       " {'시작점': '홍길동', '관계': ['KNOWS(2010)'], '도착점': '김철수'},\n",
       " {'시작점': '홍길동', '관계': ['KNOWS(2010)', 'KNOWS(2018)'], '도착점': '박규리'},\n",
       " {'시작점': '홍길동',\n",
       "  '관계': ['KNOWS(2010)', 'KNOWS(2018)', 'KNOWS(2024)'],\n",
       "  '도착점': '김하경'}]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query=\"\"\"\n",
    "//홍길동으로부터 1~3단계로 연결된 모든 사람을 찾는 쿼리\n",
    "MATCH(p1:Person {name:'홍길동'})-[r:KNOWS*1..3]->(p2:Person)\n",
    "RETURN p1.name AS 시작점, [rel IN r | type(rel)+ '('+rel.since+')'] AS 관계, p2.name AS 도착점\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9f84cb46",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'시작점': '홍길동', '도착점': '이영희'},\n",
       " {'시작점': '홍길동', '도착점': '권두현'},\n",
       " {'시작점': '홍길동', '도착점': '서윤주'},\n",
       " {'시작점': '홍길동', '도착점': '박규리'},\n",
       " {'시작점': '홍길동', '도착점': '김하경'}]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# *2 표기법은 정확히 2단계 친구 관계 조회합니다.\n",
    "# 예 : 홍길동 -> 이영희 -> 서윤주 (홍길동의 친구의 친구)\n",
    "cypher_query = \"\"\"\n",
    "MATCH (p1: Person {name: '홍길동'})-[:KNOWS*2]->(p2:Person)\n",
    "\n",
    "RETURN p1.name AS 시작점, p2.name AS 도착점\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "2999faf5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'시작점': '홍길동', '도착점': '변지민', '관계의_수': 1},\n",
       " {'시작점': '홍길동', '도착점': '김하경', '관계의_수': 2},\n",
       " {'시작점': '홍길동', '도착점': '이영희', '관계의_수': 2},\n",
       " {'시작점': '홍길동', '도착점': '서윤주', '관계의_수': 3},\n",
       " {'시작점': '홍길동', '도착점': '권두현', '관계의_수': 3},\n",
       " {'시작점': '홍길동', '도착점': '서윤주', '관계의_수': 4},\n",
       " {'시작점': '홍길동', '도착점': '이영희', '관계의_수': 1},\n",
       " {'시작점': '홍길동', '도착점': '서윤주', '관계의_수': 2},\n",
       " {'시작점': '홍길동', '도착점': '권두현', '관계의_수': 2},\n",
       " {'시작점': '홍길동', '도착점': '서윤주', '관계의_수': 3},\n",
       " {'시작점': '홍길동', '도착점': '김철수', '관계의_수': 1},\n",
       " {'시작점': '홍길동', '도착점': '박규리', '관계의_수': 2},\n",
       " {'시작점': '홍길동', '도착점': '김하경', '관계의_수': 3}]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# [:KNOWS*] 표기법은 KNOWS 관계를 통해 연결된 모든 깊이의 경로를 탐색합니다.\n",
    "# 단계 제한이 없으므로 1단계,2단계,3단계 이상 모두 포함됩니다.\n",
    "# 방향성이 있는 -> 연산자를 사용하여 홍길동에서 출발하는 단방향 관계만 조회합니다.\n",
    "\n",
    "cypher_query = \"\"\"\n",
    "MATCH (p1: Person {name: '홍길동'})-[r:KNOWS*]->(p2:Person)\n",
    "\n",
    "RETURN p1.name AS 시작점, p2.name AS 도착점, size(r) AS 관계의_수\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2485d304",
   "metadata": {},
   "source": [
    "### 3. 최단경로 (Shortest path)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b789915f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'경로': ['홍길동', '김철수', '박규리']}]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#홍길동과 박규리 사이의 최단 경로 조회\n",
    "\n",
    "cypher_query=\"\"\"\n",
    "MATCH p=shortestPath((p1:Person {name:'홍길동'})-[*]-(p2:Person {name:'박규리'}))\n",
    "\n",
    "//[*] 표기법은 모든 유형의 관계를 고려하며, 방향성 없이 양방향으로 탐색한다.\n",
    "//이는 KNOWS, LIKES 등 모든 관계 타입을 포함한다.\n",
    "\n",
    "RETURN [node IN nodes(p) | node.name] AS 경로\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4e6684c0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'경로': ['변지민', '김하경', '박규리']}]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#KNOWS 관계만을 사용하여 변지민과 박규리 사이의 최단 경로 조회\n",
    "\n",
    "cypher_query=\"\"\"\n",
    "MATCH p=shortestPath((p1:Person {name:'변지민'})-[:KNOWS*]-(p2:Person {name:'박규리'}))\n",
    "\n",
    "//[*] 표기법은 모든 유형의 관계를 고려하며, 방향성 없이 양방향으로 탐색한다.\n",
    "//이는 KNOWS, LIKES 등 모든 관계 타입을 포함한다.\n",
    "\n",
    "RETURN [node IN nodes(p) | node.name] AS 경로\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "44d84063",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'경로': ['홍길동', '변지민', '김하경']}]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#경로 길이 제한이 있는 최단 경로\n",
    "#최대 3단계 관계 내에서 홍길동과 김하경 사이의 최단 경로 조회\n",
    "#이는 너무 긴 경로를 방지하고 가까운 사회적 연결만 찾고자 할때 유용합니다.\n",
    "\n",
    "cypher_query=\"\"\"\n",
    "MATCH p=shortestPath((p1:Person {name:'홍길동'})-[*..3]-(p2:Person {name:'김하경'}))\n",
    "\n",
    "//[*] 표기법은 모든 유형의 관계를 고려하며, 방향성 없이 양방향으로 탐색한다.\n",
    "//이는 KNOWS, LIKES 등 모든 관계 타입을 포함한다.\n",
    "\n",
    "RETURN [node IN nodes(p) | node.name] AS 경로\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ae320a44",
   "metadata": {},
   "source": [
    "### 4. 집계함수 (Aggregation Functions)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "413b1c8f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'전체사람수': 8}]"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 사람 수 계산\n",
    "cypher_query=\"\"\"\n",
    "//전체 Person 노드 수 계산\n",
    "MATCH (p:Person)\n",
    "\n",
    "RETURN COUNT(p) AS 전체사람수\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "5dd0f329",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'도시': '서울', '사람수': 3},\n",
       " {'도시': '수원', '사람수': 2},\n",
       " {'도시': '구미', '사람수': 2},\n",
       " {'도시': '부산', '사람수': 1}]"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 도시 별 사람 수 계산\n",
    "cypher_query=\"\"\"\n",
    "//도시별 Person 노드 수 계산\n",
    "MATCH (p:Person)\n",
    "\n",
    "RETURN p.city AS 도시, COUNT(p) AS 사람수\n",
    "ORDER BY 사람수 DESC\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "4e0ca260",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'평균나이': 29.5}]"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 평균 나이 계산\n",
    "cypher_query=\"\"\"\n",
    "MATCH (p:Person)\n",
    "RETURN AVG(p.age) AS 평균나이\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "b3318811",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'관심분야': '영화', '사람수': 2},\n",
       " {'관심분야': '강아지', '사람수': 2},\n",
       " {'관심분야': '고양이', '사람수': 2},\n",
       " {'관심분야': '뮤지컬', '사람수': 2},\n",
       " {'관심분야': '여행', '사람수': 2}]"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 관심분야별 좋아하는 사람 수\n",
    "cypher_query=\"\"\"\n",
    "MATCH (p:Person)-[:LIKES]->(i:Interest)\n",
    "\n",
    "RETURN i.name AS 관심분야, COUNT(p) AS 사람수\n",
    "ORDER BY 사람수 DESC\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "48ef9133",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'장소': '광화문', '평균평점': 4.5}]"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 가장 높은 평점의 장소 찾기\n",
    "cypher_query=\"\"\"\n",
    "// Person 노드에서 VISITED 관계를 통해 Location 노드로 연결된 패턴을 찾는다.\n",
    "MATCH (p:Person)-[v:VISITED]->(l:Location)\n",
    "\n",
    "RETURN l.name AS 장소, AVG(v.rating) AS 평균평점\n",
    "ORDER BY 평균평점 DESC\n",
    "\n",
    "//평점이 가장 높은 장소 한개만 출력한다.\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5fd9fc75",
   "metadata": {},
   "source": [
    "### 5. WITH절\n",
    "* 중간 결과를 다음 쿼리 부분에 전달할 수 있게 해줍니다."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "91deb338",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'이름': '김철수', '나이': 28}, {'이름': '김하경', '나이': 29}]"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 기본 필터링\n",
    "cypher_query=\"\"\"\n",
    "MATCH (p:Person)\n",
    "WHERE p.age >=20\n",
    "\n",
    "//WITH p 는 이전 단계에서 필터링 된 결과(p)를 다음 쿼리 부분으로 전달한다.\n",
    "//WITH 절은 쿼리의 중간 결과를 다음 단게로 파이프라인처럼 전달하는 역할을 한다.\n",
    "WITH p\n",
    "\n",
    "WHERE p.name CONTAINS '김'\n",
    "RETURN p.name AS 이름, p.age AS 나이\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a96f08e1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'도시': '부산', '평균나이': 35.0}, {'도시': '구미', '평균나이': 31.0}]"
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 집계 결과를 중간 처리한 후 다시 활용\n",
    "cypher_query=\"\"\"\n",
    "MATCH (p:Person)\n",
    "WITH p.city AS 도시, AVG(p.age) AS 평균나이\n",
    "WHERE 평균나이 >=30\n",
    "RETURN 도시, 평균나이\n",
    "ORDER BY 평균나이 DESC\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "6262876f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'이름': '홍길동', '방문장소수': 2, '관심분야수': 2}]"
      ]
     },
     "execution_count": 48,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 복잡한 집계 작업\n",
    "cypher_query=\"\"\"\n",
    "MATCH (p:Person)\n",
    "\n",
    "//OPTIONAL MATCH를 사용하여 방문한 장소가 없는 사람도 결과에 포함시킨다.\n",
    "//방문 장소가 없는 사람의 경우 l은 NULL이 된다.\n",
    "OPTIONAL MATCH (p)-[:VISITED]->(l:Location)\n",
    "\n",
    "//각 사람(p) 별로 방문한 고유 장소(l)의 수를 계산한다.\n",
    "//이 중간 결과를 '방문장소수'라는 변수에 저장하고 다음 쿼리부분으로 전달한다.\n",
    "WITH p, Count(DISTINCT l) AS 방문장소수\n",
    "\n",
    "OPTIONAL MATCH (p)-[:LIKES]->(i:Interest)\n",
    "WITH p, 방문장소수, COUNT(DISTINCT i) AS 관심분야수\n",
    "\n",
    "WHERE 방문장소수 >=2 AND 관심분야수 >=2\n",
    "RETURN p.name AS 이름, 방문장소수, 관심분야수\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "add16435",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'시작사람': '홍길동', '연결된사람': '권두현'}]"
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 복잡한 패턴 결합\n",
    "# 같은 관심사를 가진 친구의 친구 찾기\n",
    "cypher_query=\"\"\"\n",
    "MATCH (p1: Person)-[:LIKES]->(i:Interest {name:'영화'})\n",
    "\n",
    "//앞서 찾은 영화에 관심사가 있는 사람 p1과 2단계로 연결되어있는 다른사람 p2를 찾는다.\n",
    "// 그 사람(p2)이 같은 영화 관심사 (i)ㄹㄹ 가지고 있는지 확인한다.\n",
    "// p2에서 LIKES 관계를 통해서 앞서 찾은 동일한 interest 노드(i)로 연결되어 있어야 한다.\n",
    "MATCH (p1)-[:KNOWS*2]->(p2:Person)-[:LIKES]->(i)\n",
    "\n",
    "//p1과 p2가 서로다른 사람인지 확인 -> 자기 자신으로 돌아오는 경로는 제외시키기 위함\n",
    "WHERE p1<>p2\n",
    "RETURN p1.name AS 시작사람, p2.name AS 연결된사람\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ae28c867",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'이름': '권두현', '공통관심사': '영화'}, {'이름': '김하경', '공통관심사': '여행'}]"
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 친구 관계와 공통 관심사 결합\n",
    "cypher_query=\"\"\"\n",
    "//홍길동과 같은 관심사를 가진 모든 사람들을 식별한다.\n",
    "MATCH (p1:Person {name:'홍길동'})-[:LIKES]->(i:Interest)<-[:LIKES]-(p2:Person)\n",
    "\n",
    "// 홍길동과 직접적으로 알고있는 사이가 아닌 경우만 찾아냄\n",
    "WHERE NOT (p1)-[:KNOWS]-(p2) \n",
    "RETURN DISTINCT p2.name AS 이름, i.name AS 공통관심사\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d3807187",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'거리': 1, '사람수': 3}, {'거리': 2, '사람수': 4}]"
      ]
     },
     "execution_count": 51,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 최단 경로와 집계 함수 결합\n",
    "cypher_query=\"\"\"\n",
    "// 홍길동과 다른 사람들까지의 최단 경로를 찾는다.\n",
    "MATCH p=shortestPath((start:Person {name:'홍길동'})-[:KNOWS*]-(other:Person))\n",
    "WHERE start <> other\n",
    "WITH other, length(p) AS 거리\n",
    "RETURN 거리, COUNT(other) AS 사람수\n",
    "\n",
    "// 결과를 거리 값에 따라 오름차순으로 정렬한다.\n",
    "ORDER BY 거리\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f8405fb9",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
