{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "47cc1071",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv\n",
    "load_dotenv()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "a70a4aef",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_neo4j import Neo4jGraph\n",
    "\n",
    "graph = Neo4jGraph(\n",
    "    url = os.getenv(\"NEO4J_URI\"),\n",
    "    username = os.getenv(\"NEO4J_USERNAME\"),\n",
    "    password = os.getenv(\"NEO4J_PASSWORD\")\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "e12f27c6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'n': {'name': 'Hello AuraDB'}}]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#테스트 쿼리 실행 - Neo4j 연결이 제대로 작동하는지 확인하기 위한 간단한 테스트\n",
    "#Cypher 쿼리를 사용하여 Test 레이블을 가진 노드를 생성하고 반환한다.\n",
    "cypher_query = \"\"\"\n",
    "CREATE (n:Test {name: \"Hello AuraDB\"})\n",
    "RETURN n\n",
    "\"\"\"\n",
    "\n",
    "#이 쿼리가 성공적으로 실해오디면 Neo4J DB연결이 정상적으로 작동하는 것임\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "ec9e3ec3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "데이터베이스가 초기화되었습니다.\n"
     ]
    }
   ],
   "source": [
    "def reset_database(graph):\n",
    "    \"\"\"데이터베이스 초기화하기\"\"\"\n",
    "    #모든 노드와 관계 삭제\n",
    "    graph.query(\"MATCH (n) DETACH DELETE n\")\n",
    "\n",
    "    #모든 제약조건 삭제\n",
    "    constraints = graph.query(\"SHOW CONSTRAINTS\")\n",
    "    for constraint in constraints:\n",
    "        constraint_name = constraint.get(\"name\")\n",
    "        if constraint_name:\n",
    "            graph.query(f\"DROP CONSTRAINT {constraint_name}\")\n",
    "    \n",
    "    #모든 인덱스 삭제\n",
    "    indexes = graph.query(\"SHOW INDEXES\")\n",
    "    for index in indexes:\n",
    "        index_name = index.get(\"name\")\n",
    "        index_type = index.get(\"type\")\n",
    "        if index_name and index_type != \"CONSTRAINT\":\n",
    "            graph.query(f\"DROP INDEX {index_name}\")\n",
    "    \n",
    "    print(\"데이터베이스가 초기화되었습니다.\")\n",
    "\n",
    "#데이터베이스 초기화\n",
    "reset_database(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "1d2a9e32",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Neo4j 데이터베이스에 노드 생성하기 (CREATE 구문 사용)\n",
    "#동일한 노드가 이미 존재해도 중복생성되므로 주의 해야 함\n",
    "cypher_query = \"\"\"\n",
    "// 주석은 아래와 같이 처리할 수 있음\n",
    "// 노드 레이블 : Person (사람을 나타내는 레이블)\n",
    "// 노드 속성 정의:\n",
    "// - name : \"서소망\" (이름)\n",
    "// - age : 10 (나이)\n",
    "// - email : somang@gmail.com (이메일 주소)\n",
    "// p는 생성된 노드를 참조하는 변수명입니다.\n",
    "\n",
    "CREATE (p:Person {name : \"서소망\", age: 10, email : \"somang@gmail.com\"}) \n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "de468300",
   "metadata": {},
   "source": [
    "### 1. 노드(Node) 표현"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "92bbaa4f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#CREATE 구문을 사용하여 여러 노드를 한번에 생성할 수 있음\n",
    "cypher_query = \"\"\"\n",
    "// 노드 레이블 정의 : \n",
    "// - Person : 사람을 나타내는 레이블\n",
    "// - City : 도시를 타나내는 레이블\n",
    "//\n",
    "// Person 노드 속성 정의\n",
    "// - name : 사람의 이름 (문자열)\n",
    "// - age : 사람의 나이 (숫자)\n",
    "//\n",
    "// City 노드 속성 정의 :\n",
    "// - name : 도시 이름 (문자열)\n",
    "// - population : 인구수 (숫자)\n",
    "//\n",
    "// 변수 a,b,c는 각각 생성된 노드를 참조하는 변수명 입니다.\n",
    "CREATE\n",
    " (a: Person {name: \"김철수\", age :25}),\n",
    " (b: Person {name: \"이영희\", age :28}),\n",
    " (c: City {name : \"서울\", population: 9700000})\n",
    "\"\"\"\n",
    "\n",
    "#graph.query() 를 사용하여 Cypher 쿼리를 실행합니다.\n",
    "#이 명령은 Neo4j 데이터베이스에 세 개의 노드를 한 번에 생성합니다.\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e5c8d9d4",
   "metadata": {},
   "source": [
    "### 2. 관계 (Relationship) 표현"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "88fb27b4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'a': {'name': '서소망', 'age': 10, 'email': 'somang@gmail.com'},\n",
       "  'b': {'name': '김철수', 'age': 25},\n",
       "  'r': ({'name': '서소망', 'age': 10, 'email': 'somang@gmail.com'},\n",
       "   'KNOWS',\n",
       "   {'name': '김철수', 'age': 25})}]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#기존 노드 사이에 관계 생성하기\n",
    "cypher_query=\"\"\"\n",
    "// 관계 레이블 : KNOWS (알고 있다는 관계를 나타냄)\n",
    "// 관계 속성 : since (관계가 시작된 시점을 타나내는 속성)\n",
    "// 관계 방향 : a -> b (서소망이 김철수를 알고 있는 방향성)\n",
    "// 관계 속성 값 : since : 2020 (2020년부터 관계가 시작됨)\n",
    "// 관계 생성 의미 : 서소망은 김철수를 2020년부터 알게 됨\n",
    "\n",
    "// MATCH 구문으로 두 개의 기존 노드를 찾음\n",
    "MATCH\n",
    "    (a: Person {name: \"서소망\"}), // Person 레이블을 가진 이름이 서소망인 노드를 찾아 변수 a에 할당\n",
    "    (b: Person {name: \"김철수\"}) // Person 레이블을 가진 이름이 김철수인 노드를 찾아 변수 b에 할당\n",
    "\n",
    "//CREATE 구문으로 두 노드 사이에 방향성 있는 관계 생성\n",
    "CREATE (a)-[r:KNOWS {since: 2020}] -> (b) // a에서 b로 향하는 KNOWS 타입의 관계 r 생성, since 속성 추가\n",
    "\n",
    "//RETURN 구문으로 노드와 관계 정보 반환\n",
    "RETURN a,b,r // 생성된 관계와 연결되 두 정보를 함께 반환\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "df3d95d9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'a': {'name': '이삼백'}, 'c': {'name': '도쿄'}}]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 노드와 관계를 한번에 생성하는 Cypher 쿼리\n",
    "cypher_query = \"\"\"\n",
    "// 노드 레이블 : Person, City (각각 사람과 도시를 나타내는 레이블)\n",
    "// CREATE 구문으로 노드와 관계를 동시에 생성\n",
    "CREATE\n",
    "    // a 변수에 Person 레이블을 가진 노드 생성, 속성으로 name = \"이삼백\" 설정\n",
    "    (a: Person {name: \"이삼백\"})-[:LIVES_IN]-> \n",
    "    \n",
    "    // c 변수에 City 레이블을 가진 노드 생성, 속성으로 name =\"도쿄\" 설정\n",
    "    // LIVES_IN 관계는 '살고 있다'는 의미로 이삼백이 도쿄에 거주함을 나타냄\n",
    "    (c: City {name: \"도쿄\"})\n",
    "// RETURN 구문으로 생성된 두 노드 정보 반환\n",
    "RETURN a,c\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "e97eabe6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'a': {'name': '이영희', 'age': 28},\n",
       "  'c': {'name': '서울', 'population': 9700000},\n",
       "  'r': ({'name': '이영희', 'age': 28},\n",
       "   'LIVES_IN',\n",
       "   {'name': '서울', 'population': 9700000})}]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 기존에 생성된 노드들 사이에 관계를 추가하는 Cypher 쿼리\n",
    "cypher_query=\"\"\"\n",
    "// 관계 레이블 : LIVES_In (거주한다는 의미의 관계 타입)\n",
    "// 관계 방향 : a -> c (이영희가 서울에 산다는 방향성)\n",
    "// 관계 속성 : since : 2020 (2020년부터 관계가 시작됨)\n",
    "// 관계 생성 의미 : 이영희는 서울에 2020년부터 거주하기 시작함\n",
    "\n",
    "// MATCH 구문으로 두 개의 기존 노드를 찾음\n",
    "MATCH \n",
    "    (a: Person {name: \"이영희\"}),\n",
    "    (c: City {name: \"서울\"})\n",
    "    \n",
    "// CREATE 구문으로 두 노드 사이에 방향성 있는 관계 생성\n",
    "CREATE (a)- [r:LIVES_IN {since: 2020}] -> (c) // a에서 c로 향하는 LIVES_IN 타입의 관계 r 생성하고 since 속성 추가\n",
    "\n",
    "// RETURN 구문으로 노드의 관계 정보 반환\n",
    "RETURN a,c,r //생성된 관계와 연결된 두 노드 정보를 함께 반환\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "2cd3035f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 기존에 생성된 노드들 사이에 여러 관계를 추가하는 Cypher 쿼리\n",
    "cypher_query = \"\"\"\n",
    "// 첫 번째 관계 정보\n",
    "// 관계 레이블 : LIVES_IN (거주한다는 의미의 관계 타입)\n",
    "// 관계 방향 : a -> c (서소망이 서울에 산다는 방향성)\n",
    "// 관계 속성 : since 2010 (2010년부터 관계가 시작됨)\n",
    "// 관계 생성 의미 : 서소망은 서울에 2010년부터 거주하기 시작함\n",
    "\n",
    "// 두 번째 관계 정보\n",
    "// 관계 레이블 : KNOWS (안다/알고 있다는 의미의 관계 타입)\n",
    "// 관계 방향 : a -> b (서소망이 이삼백을 안다는 방향성)\n",
    "// 관계 속성 : since 2020 (2020년부터 관계가 시작됨)\n",
    "// 관계 생성 의미 : 서소망은 이삼백을 2020년부터 알게 됨\n",
    "\n",
    "// 세 번째 관계 정보\n",
    "// 관계 레이블 : KNOWS (안다/알고 있다는 의미의 관계 타입)\n",
    "// 관계 방향 : b -> a (이삼백이 서소망을 안다는 방향성)\n",
    "// 관계 속성 : since 2020 (2020년부터 관계가 시작됨)\n",
    "// 관계 생성 의미 : 서소망은 이삼백을 2020년부터 알게 됨\n",
    "// 두 번째와 세 번째 관계를 통해 양방향 관계(b <-> a)를 표현함\n",
    "\n",
    "// MATCH 구문으로 세 개의 기존 노드를 찾음\n",
    "MATCH\n",
    "    (a: Person {name: \"서소망\"}), // Person 레이블을 가진 이름이 서소망인 노드를 찾아 변수 a에 할당\n",
    "    (b: Person {name: \"이삼백\"}),\n",
    "    (c: City {name : \"서울\"})\n",
    "\n",
    "CREATE (a)-[r1:LIVES_IN {since:2010}]->(c)\n",
    "CREATE (a)-[r2:KNOWS {since:2020}]->(b)\n",
    "CREATE (b)-[r3:KNOWS {since:2020}]->(a)\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "9cf9fb19",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'DeletedRelationshipsCount': 1},\n",
       " {'DeletedRelationshipsCount': 2},\n",
       " {'DeletedRelationshipsCount': 2}]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p)-[r:LIVES_IN]->(c)\n",
    "WITH p, c, collect(r) AS rels\n",
    "WHERE size(rels) > 1\n",
    "WITH tail(rels) AS relsToDelete\n",
    "UNWIND relsToDelete AS rel\n",
    "DELETE rel\n",
    "RETURN size(relsToDelete) AS DeletedRelationshipsCount;\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cdce9441",
   "metadata": {},
   "source": [
    "### 3. 변수 (Variable) / 별칭 (Alias) 활용"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "55b859c8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "노드 조회 결과:\n",
      "{'p': {'name': '김철수', 'age': 25}}\n",
      "{'p': {'name': '서소망', 'age': 10, 'email': 'somang@gmail.com'}}\n",
      "{'p': {'name': '이영희', 'age': 28}}\n",
      "{'p': {'name': '이삼백'}}\n"
     ]
    }
   ],
   "source": [
    "# 노드 조회 (RETURN 구문)\n",
    "cypher_query = \"\"\"\n",
    "// Person 레이블을 가진 모든 노드 조회\n",
    "MATCH (p:Person)\n",
    "RETURN p\n",
    "\"\"\"\n",
    "result = graph.query(cypher_query)\n",
    "\n",
    "print(\"노드 조회 결과:\")\n",
    "for record in result :\n",
    "    print(record)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "c5f07a7a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "노드 조회 결과:\n",
      "{'Name': '김철수'}\n",
      "{'Name': '서소망'}\n",
      "{'Name': '이영희'}\n",
      "{'Name': '이삼백'}\n"
     ]
    }
   ],
   "source": [
    "#노드 조회 (속성반환)\n",
    "cypher_query = \"\"\"\n",
    "// Person 레이블을 가진 모든 노드의 name 속성 조회\n",
    "MATCH(p: Person)\n",
    "RETURN p.name AS Name\n",
    "\"\"\"\n",
    "\n",
    "result = graph.query(cypher_query)\n",
    "print(\"노드 조회 결과:\")\n",
    "for record in result:\n",
    "    print(record)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "67ed91a2",
   "metadata": {},
   "source": [
    "### 4. 주요구문 (MATCH, WHERE, SET, DELETE, REMOVE 등)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3b750a19",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Name': '서소망', 'City': '서울'},\n",
       " {'Name': '이영희', 'City': '서울'},\n",
       " {'Name': '이삼백', 'City': '도쿄'}]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Neo4j 그래프DB에서 노드 가느이 관계를 조회하는 예제\n",
    "cypher_query=\"\"\"\n",
    "// Person 레이블을 가진 노드와 City 레이블을 가진 노드 사이의 관계 조회\n",
    "// (p:Person) : Person 타입의 노드를 p 변수에 할당\n",
    "// -[r:LIVES_IN]->:LIVES_IN 타입의 관계를 r 변수에 할당하고, 방향은 Person에서 City로 향함\n",
    "// (c: City) : City 타입의 노드를 c 변수에 할당\n",
    "MATCH (p:Person)-[r:LIVES_IN]->(c:City)\n",
    "\n",
    "// p.name As Name : Person 노드의 name 속성을 'Name'이라는 별칭으로 반환\n",
    "// c.name As City : City 노드의 name 속성을 'City' 라는 별칭으로 반환\n",
    "RETURN p.name As Name, c.name As City\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "d53e3e06",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'p': {'name': '이영희', 'age': 28}}]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 조건 지정 (WHERE 구문)\n",
    "# WHERE 구문은 MATCH로 찾은 패턴에 추가 조건을 적용할 때 사용한다.\n",
    "cypher_query=\"\"\"\n",
    "// Person 레이블을 가진 노드 중에서 age 속성이 30 이상이고 사는 도시가 서울인 노드 조회\n",
    "MATCH (p:Person)-[r:LIVES_IN]->(c:City)\n",
    "\n",
    "WHERE p.age >=20 AND c.name=\"서울\"\n",
    "RETURN p\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "0f05add7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'p': {'name': '이삼백', 'age': 30}}]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#노드 속성 업데이트 (SET 구문 사용)\n",
    "cypher_query=\"\"\"\n",
    "MATCH (p:Person {name:\"이삼백\"})\n",
    "\n",
    "// p로 참조된 노드의 'age' 속성 값을 30 으로 설정합니다.\n",
    "// 해당 속성이 이미 존재하면 값을 변경하고, 없으면 새로 생성한다.\n",
    "SET p.age =30\n",
    "\n",
    "// 업데이트된 노드를 결과로 반환합니다.\n",
    "RETURN p\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "6f3f0a16",
   "metadata": {},
   "outputs": [
    {
     "ename": "ConstraintError",
     "evalue": "{code: Neo.ClientError.Schema.ConstraintValidationFailed} {message: Cannot delete node<2>, because it still has relationships. To delete this node, you must first delete its relationships.}",
     "output_type": "error",
     "traceback": [
      "\u001b[31m---------------------------------------------------------------------------\u001b[39m",
      "\u001b[31mConstraintError\u001b[39m                           Traceback (most recent call last)",
      "\u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[34]\u001b[39m\u001b[32m, line 11\u001b[39m\n\u001b[32m      1\u001b[39m \u001b[38;5;66;03m#노드 삭제 작업 수행\u001b[39;00m\n\u001b[32m      2\u001b[39m cypher_query=\u001b[33m\"\"\"\u001b[39m\n\u001b[32m      3\u001b[39m \u001b[33mMATCH (p:Person \u001b[39m\u001b[33m{\u001b[39m\u001b[33mname:\u001b[39m\u001b[33m\"\u001b[39m\u001b[33m이영희\u001b[39m\u001b[33m\"\u001b[39m\u001b[33m})\u001b[39m\n\u001b[32m      4\u001b[39m \n\u001b[32m   (...)\u001b[39m\u001b[32m      8\u001b[39m \u001b[33mDELETE p\u001b[39m\n\u001b[32m      9\u001b[39m \u001b[33m\"\"\"\u001b[39m\n\u001b[32m---> \u001b[39m\u001b[32m11\u001b[39m \u001b[43mgraph\u001b[49m\u001b[43m.\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m(\u001b[49m\u001b[43mcypher_query\u001b[49m\u001b[43m)\u001b[49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\yoonj\\vscodeProjects\\AKIS-RAG-STUDY\\GraphRAG (w.neo4J)\\.venv\\Lib\\site-packages\\langchain_neo4j\\graphs\\neo4j_graph.py:456\u001b[39m, in \u001b[36mNeo4jGraph.query\u001b[39m\u001b[34m(self, query, params, session_params)\u001b[39m\n\u001b[32m    454\u001b[39m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m session_params:\n\u001b[32m    455\u001b[39m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m456\u001b[39m         data, _, _ = \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_driver\u001b[49m\u001b[43m.\u001b[49m\u001b[43mexecute_query\u001b[49m\u001b[43m(\u001b[49m\n\u001b[32m    457\u001b[39m \u001b[43m            \u001b[49m\u001b[43mQuery\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtext\u001b[49m\u001b[43m=\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mtimeout\u001b[49m\u001b[43m=\u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43mtimeout\u001b[49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    458\u001b[39m \u001b[43m            \u001b[49m\u001b[43mdatabase_\u001b[49m\u001b[43m=\u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_database\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    459\u001b[39m \u001b[43m            \u001b[49m\u001b[43mparameters_\u001b[49m\u001b[43m=\u001b[49m\u001b[43mparams\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    460\u001b[39m \u001b[43m        \u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    461\u001b[39m         json_data = [r.data() \u001b[38;5;28;01mfor\u001b[39;00m r \u001b[38;5;129;01min\u001b[39;00m data]\n\u001b[32m    462\u001b[39m         \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m.sanitize:\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\yoonj\\vscodeProjects\\AKIS-RAG-STUDY\\GraphRAG (w.neo4J)\\.venv\\Lib\\site-packages\\neo4j\\_sync\\driver.py:978\u001b[39m, in \u001b[36mDriver.execute_query\u001b[39m\u001b[34m(self, query_, parameters_, routing_, database_, impersonated_user_, bookmark_manager_, auth_, result_transformer_, **kwargs)\u001b[39m\n\u001b[32m    974\u001b[39m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mValueError\u001b[39;00m(\n\u001b[32m    975\u001b[39m         \u001b[33mf\u001b[39m\u001b[33m\"\u001b[39m\u001b[33mInvalid routing control value: \u001b[39m\u001b[38;5;132;01m{\u001b[39;00mrouting_\u001b[38;5;132;01m!r}\u001b[39;00m\u001b[33m\"\u001b[39m\n\u001b[32m    976\u001b[39m     )\n\u001b[32m    977\u001b[39m \u001b[38;5;28;01mwith\u001b[39;00m session._pipelined_begin:\n\u001b[32m--> \u001b[39m\u001b[32m978\u001b[39m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43msession\u001b[49m\u001b[43m.\u001b[49m\u001b[43m_run_transaction\u001b[49m\u001b[43m(\u001b[49m\n\u001b[32m    979\u001b[39m \u001b[43m        \u001b[49m\u001b[43maccess_mode\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    980\u001b[39m \u001b[43m        \u001b[49m\u001b[43mTelemetryAPI\u001b[49m\u001b[43m.\u001b[49m\u001b[43mDRIVER\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    981\u001b[39m \u001b[43m        \u001b[49m\u001b[43mwork\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    982\u001b[39m \u001b[43m        \u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery_str\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparameters\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mresult_transformer_\u001b[49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    983\u001b[39m \u001b[43m        \u001b[49m\u001b[43m{\u001b[49m\u001b[43m}\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    984\u001b[39m \u001b[43m    \u001b[49m\u001b[43m)\u001b[49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\yoonj\\vscodeProjects\\AKIS-RAG-STUDY\\GraphRAG (w.neo4J)\\.venv\\Lib\\site-packages\\neo4j\\_sync\\work\\session.py:600\u001b[39m, in \u001b[36mSession._run_transaction\u001b[39m\u001b[34m(self, access_mode, api, transaction_function, args, kwargs)\u001b[39m\n\u001b[32m    598\u001b[39m         \u001b[38;5;28;01mraise\u001b[39;00m\n\u001b[32m    599\u001b[39m     \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m600\u001b[39m         \u001b[43mtx\u001b[49m\u001b[43m.\u001b[49m\u001b[43m_commit\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    601\u001b[39m \u001b[38;5;28;01mexcept\u001b[39;00m (DriverError, Neo4jError) \u001b[38;5;28;01mas\u001b[39;00m error:\n\u001b[32m    602\u001b[39m     \u001b[38;5;28mself\u001b[39m._disconnect()\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\yoonj\\vscodeProjects\\AKIS-RAG-STUDY\\GraphRAG (w.neo4J)\\.venv\\Lib\\site-packages\\neo4j\\_sync\\work\\transaction.py:225\u001b[39m, in \u001b[36mTransactionBase._commit\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m    223\u001b[39m \u001b[38;5;28mself\u001b[39m._connection.commit(on_success=metadata.update)\n\u001b[32m    224\u001b[39m \u001b[38;5;28mself\u001b[39m._connection.send_all()\n\u001b[32m--> \u001b[39m\u001b[32m225\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_connection\u001b[49m\u001b[43m.\u001b[49m\u001b[43mfetch_all\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    226\u001b[39m \u001b[38;5;28mself\u001b[39m._bookmark = metadata.get(\u001b[33m\"\u001b[39m\u001b[33mbookmark\u001b[39m\u001b[33m\"\u001b[39m)\n\u001b[32m    227\u001b[39m \u001b[38;5;28mself\u001b[39m._database = metadata.get(\u001b[33m\"\u001b[39m\u001b[33mdb\u001b[39m\u001b[33m\"\u001b[39m, \u001b[38;5;28mself\u001b[39m._database)\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\yoonj\\vscodeProjects\\AKIS-RAG-STUDY\\GraphRAG (w.neo4J)\\.venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt.py:878\u001b[39m, in \u001b[36mBolt.fetch_all\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m    876\u001b[39m response = \u001b[38;5;28mself\u001b[39m.responses[\u001b[32m0\u001b[39m]\n\u001b[32m    877\u001b[39m \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m response.complete:\n\u001b[32m--> \u001b[39m\u001b[32m878\u001b[39m     detail_delta, summary_delta = \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43mfetch_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    879\u001b[39m     detail_count += detail_delta\n\u001b[32m    880\u001b[39m     summary_count += summary_delta\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\yoonj\\vscodeProjects\\AKIS-RAG-STUDY\\GraphRAG (w.neo4J)\\.venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt.py:863\u001b[39m, in \u001b[36mBolt.fetch_message\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m    859\u001b[39m \u001b[38;5;66;03m# Receive exactly one message\u001b[39;00m\n\u001b[32m    860\u001b[39m tag, fields = \u001b[38;5;28mself\u001b[39m.inbox.pop(\n\u001b[32m    861\u001b[39m     hydration_hooks=\u001b[38;5;28mself\u001b[39m.responses[\u001b[32m0\u001b[39m].hydration_hooks\n\u001b[32m    862\u001b[39m )\n\u001b[32m--> \u001b[39m\u001b[32m863\u001b[39m res = \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_process_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtag\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mfields\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    864\u001b[39m \u001b[38;5;28mself\u001b[39m.idle_since = monotonic()\n\u001b[32m    865\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m res\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\yoonj\\vscodeProjects\\AKIS-RAG-STUDY\\GraphRAG (w.neo4J)\\.venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt5.py:1208\u001b[39m, in \u001b[36mBolt5x7._process_message\u001b[39m\u001b[34m(self, tag, fields)\u001b[39m\n\u001b[32m   1206\u001b[39m \u001b[38;5;28mself\u001b[39m._enrich_error_diagnostic_record(summary_metadata)\n\u001b[32m   1207\u001b[39m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[32m-> \u001b[39m\u001b[32m1208\u001b[39m     \u001b[43mresponse\u001b[49m\u001b[43m.\u001b[49m\u001b[43mon_failure\u001b[49m\u001b[43m(\u001b[49m\u001b[43msummary_metadata\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;129;43;01mor\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43m{\u001b[49m\u001b[43m}\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m   1209\u001b[39m \u001b[38;5;28;01mexcept\u001b[39;00m (ServiceUnavailable, DatabaseUnavailable):\n\u001b[32m   1210\u001b[39m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m.pool:\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\yoonj\\vscodeProjects\\AKIS-RAG-STUDY\\GraphRAG (w.neo4J)\\.venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:263\u001b[39m, in \u001b[36mResponse.on_failure\u001b[39m\u001b[34m(self, metadata)\u001b[39m\n\u001b[32m    261\u001b[39m handler = \u001b[38;5;28mself\u001b[39m.handlers.get(\u001b[33m\"\u001b[39m\u001b[33mon_summary\u001b[39m\u001b[33m\"\u001b[39m)\n\u001b[32m    262\u001b[39m Util.callback(handler)\n\u001b[32m--> \u001b[39m\u001b[32m263\u001b[39m \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;28mself\u001b[39m._hydrate_error(metadata)\n",
      "\u001b[31mConstraintError\u001b[39m: {code: Neo.ClientError.Schema.ConstraintValidationFailed} {message: Cannot delete node<2>, because it still has relationships. To delete this node, you must first delete its relationships.}"
     ]
    }
   ],
   "source": [
    "#노드 삭제 작업 수행\n",
    "cypher_query=\"\"\"\n",
    "MATCH (p:Person {name:\"이영희\"})\n",
    "\n",
    "//주의 : 이 방식은 관계가 없는 노드만 삭제 가능합니다.\n",
    "//노드에 관계가 있는 경우 ConstraintValidationFailed 오류 발생\n",
    "//관계가 있는 노드를 삭제하려면 DETACH DELETE를 사용해야 합니다.\n",
    "DELETE p\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "68dd6286",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 관계가 있는 노드 삭제 (DETACH DELETE 사용)\n",
    "cypher_query=\"\"\"\n",
    "MATCH (p:Person {name: \"이영희\"})\n",
    "DETACH DELETE p\n",
    "\"\"\"\n",
    "\n",
    "# 결과로 이영희 노드와 그에 연결된 모든 관계가 함께 삭제됩니다.\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "49508559",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 관계 삭제 수행\n",
    "cypher_query=\"\"\"\n",
    "// Person 레이블을 가진 노드 중에서 name 속성이 \"서소망\"인 노드와 \"김철수\"인 노드 사이의 관계를 찾습니다.\n",
    "MATCH\n",
    "    (a: Person {name:\"서소망\"})-[r]->(b:Person {name:\"김철수\"})\n",
    "\n",
    "// DELETE r 명령어를 사용하여 찾은 관계만 삭제합니다.\n",
    "// 이 명령은 노드는 그대로 유지하고 두 노드 사이의 관계만 제거합니다.\n",
    "// 노드 삭제와 달리 관계 삭제는 DETACH 키워드가 필요하지 않습니다.\n",
    "DELETE r\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "e33550a7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'p': {'name': '서소망', 'email': 'somang@gmail.com'}}]"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 속성 제거 (REMOVE 구문 사용)\n",
    "cypher_query=\"\"\"\n",
    "MATCH (p:Person {name: \"서소망\"})\n",
    "\n",
    "// REMOVE 명령어를 사용하여 찾은 노드의 age 속성을 제거한다.\n",
    "// 이 명령은 노드 자체나 다른 속성은 그대로 유지하고 지정된 속성만 삭제합니다.\n",
    "// 속성이 존재하지 않는 경우에도 오류 없이 실행됩니다.\n",
    "REMOVE p.age\n",
    "\n",
    "RETURN p\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "e841b087",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'p': {'name': '서소망', 'email': 'somang@gmail.com'}}]"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 레이블 제거 (REMOVE 구문 사용)\n",
    "cypher_query=\"\"\"\n",
    "MATCH (p:Person {name:\"서소망\"})\n",
    "\n",
    "// REMOVE 명령어를 사용하여 찾은 노드에서 Person 레이블을 제거합니다.\n",
    "// 이 명령은 노드 자체나 속성은 그대로 유지하고 지정된 레이블만 삭제합니다.\n",
    "// 레이블이 제거되면 해당 노드는 더 이상 Person으로 분류되지 않습니다.\n",
    "// 노드에 다른 레이블이 있다면 그 레이블은 유지됩니다.\n",
    "REMOVE p:Person\n",
    "\n",
    "RETURN p\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "dd7a1dc6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'p': {'name': '서소망', 'age': 10, 'email': 'somang@gmail.com'}}]"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 레이블 추가 및 속성 설정 (SET 구문 사용)\n",
    "cypher_query=\"\"\"\n",
    "// name 속성이 \"서소망\"인 노드를 찾습니다.\n",
    "// 이 노드는 이전 쿼리에서 Person 레이블이 제거되었습니다.\n",
    "MATCH (p {name: \"서소망\"})\n",
    "\n",
    "// SET 명령어를 사용하여 노드에 Person 레이블을 다시 추가하고 age 속성을 10으로 설정합니다.\n",
    "SET p: Person, p.age =10\n",
    "\n",
    "RETURN p\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "312953e2",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: page)} {position: line: 7, column: 12, offset: 75} for query: '\\n// DB에서 Person으로 분류된 모든 개체를 검색합니다.\\nMATCH (p:Person)\\n\\nRETURN p\\n\\nORDER BY p.page ASC\\nLIMIT 2\\n'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "나이 순 정렬 결과:\n",
      "{'p': {'name': '서소망', 'age': 10, 'email': 'somang@gmail.com'}}\n",
      "{'p': {'name': '김철수', 'age': 25}}\n"
     ]
    }
   ],
   "source": [
    "# 나이 순 정렬 - ORDER BY 와 LIMIT 사용 예제\n",
    "cypher_query=\"\"\"\n",
    "// DB에서 Person으로 분류된 모든 개체를 검색합니다.\n",
    "MATCH (p:Person)\n",
    "\n",
    "RETURN p\n",
    "\n",
    "// 나이를 오름차순으로 정렬 (최대 2명까지)\n",
    "ORDER BY p.page ASC\n",
    "LIMIT 2\n",
    "\"\"\"\n",
    "result = graph.query(cypher_query)\n",
    "\n",
    "print(\"나이 순 정렬 결과:\")\n",
    "for record in result:\n",
    "    print(record)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "92f422ea",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "나이 순 정렬 결과:\n",
      "{'p': {'name': '김철수', 'age': 25}}\n"
     ]
    }
   ],
   "source": [
    "# 나이 순 정렬 (SKIP 사용)\n",
    "cypher_query = \"\"\"\n",
    "MATCH (p:Person)\n",
    "RETURN p\n",
    "ORDER BY p.age ASC\n",
    "\n",
    "// SKIP 절을 사용하여 결과의 처음 1개를 건너뜁니다.\n",
    "SKIP 1\n",
    "\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "result = graph.query(cypher_query)\n",
    "print(\"나이 순 정렬 결과:\")\n",
    "for record in result:\n",
    "    print(record)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "de68691a",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
