{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "dca35b09",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "load_dotenv()\n",
    "\n",
    "from langchain_neo4j import Neo4jGraph\n",
    "\n",
    "#LangChain 도구 활용 - DB연결 객체 초기화\n",
    "graph = Neo4jGraph(\n",
    "    url = os.getenv(\"NEO4J_URI\"),\n",
    "    username = os.getenv(\"NEO4J_USERNAME\"),\n",
    "    password = os.getenv(\"NEO4J_PASSWORD\"),\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "41184c0f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Movie_count': 4803}]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 테스트 쿼리 실행\n",
    "cypher_query=\"\"\"\n",
    "MATCH (n:Movie)\n",
    "RETURN COUNT(n) AS Movie_count\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7a0c1823",
   "metadata": {},
   "source": [
    "### 2.1 기본 분석 쿼리"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "66894eab",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Movie': 'Stiff Upper Lips', 'Released': '1998-06-12', 'Rating': 10.0},\n",
       " {'Movie': 'Little Big Top', 'Released': '2006-01-01', 'Rating': 10.0},\n",
       " {'Movie': 'Me You and Five Bucks', 'Released': '2015-07-07', 'Rating': 10.0},\n",
       " {'Movie': 'Dancer, Texas Pop. 81', 'Released': '1998-05-01', 'Rating': 10.0},\n",
       " {'Movie': 'Sardaarji', 'Released': '2015-06-26', 'Rating': 9.5},\n",
       " {'Movie': \"One Man's Hero\", 'Released': '1999-08-02', 'Rating': 9.3},\n",
       " {'Movie': 'The Shawshank Redemption',\n",
       "  'Released': '1994-09-23',\n",
       "  'Rating': 8.5},\n",
       " {'Movie': 'There Goes My Baby', 'Released': '1994-09-02', 'Rating': 8.5},\n",
       " {'Movie': 'The Prisoner of Zenda', 'Released': '1937-09-03', 'Rating': 8.4},\n",
       " {'Movie': 'The Godfather', 'Released': '1972-03-14', 'Rating': 8.4}]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 평점 기준 상위 10개 영화를 조회하는 cypher 쿼리\n",
    "cypher_query=\"\"\"\n",
    "MATCH (m:Movie) // Movie 라벨을 가진 모든 노드 매칭\n",
    "WHERE m.rating IS NOT NULL // 평점 값이 존재하는 영화만 필터링\n",
    "RETURN  m.title AS Movie,\n",
    "        m.released AS Released,\n",
    "        m.rating AS Rating\n",
    "ORDER BY m.rating DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "result = graph.query(cypher_query)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "be2a9bb6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Movie</th>\n",
       "      <th>Released</th>\n",
       "      <th>Rating</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Stiff Upper Lips</td>\n",
       "      <td>1998-06-12</td>\n",
       "      <td>10.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Little Big Top</td>\n",
       "      <td>2006-01-01</td>\n",
       "      <td>10.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Me You and Five Bucks</td>\n",
       "      <td>2015-07-07</td>\n",
       "      <td>10.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Dancer, Texas Pop. 81</td>\n",
       "      <td>1998-05-01</td>\n",
       "      <td>10.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Sardaarji</td>\n",
       "      <td>2015-06-26</td>\n",
       "      <td>9.5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>One Man's Hero</td>\n",
       "      <td>1999-08-02</td>\n",
       "      <td>9.3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>The Shawshank Redemption</td>\n",
       "      <td>1994-09-23</td>\n",
       "      <td>8.5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>There Goes My Baby</td>\n",
       "      <td>1994-09-02</td>\n",
       "      <td>8.5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>The Prisoner of Zenda</td>\n",
       "      <td>1937-09-03</td>\n",
       "      <td>8.4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>The Godfather</td>\n",
       "      <td>1972-03-14</td>\n",
       "      <td>8.4</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                      Movie    Released  Rating\n",
       "0          Stiff Upper Lips  1998-06-12    10.0\n",
       "1            Little Big Top  2006-01-01    10.0\n",
       "2     Me You and Five Bucks  2015-07-07    10.0\n",
       "3     Dancer, Texas Pop. 81  1998-05-01    10.0\n",
       "4                 Sardaarji  2015-06-26     9.5\n",
       "5            One Man's Hero  1999-08-02     9.3\n",
       "6  The Shawshank Redemption  1994-09-23     8.5\n",
       "7        There Goes My Baby  1994-09-02     8.5\n",
       "8     The Prisoner of Zenda  1937-09-03     8.4\n",
       "9             The Godfather  1972-03-14     8.4"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "pd.DataFrame(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "8330ed89",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'CoActor': 'Tim Allen', 'MoviesTogether': 3},\n",
       " {'CoActor': 'Joan Cusack', 'MoviesTogether': 2},\n",
       " {'CoActor': 'Gary Sinise', 'MoviesTogether': 2},\n",
       " {'CoActor': 'Don Rickles', 'MoviesTogether': 2},\n",
       " {'CoActor': 'Martin Sheen', 'MoviesTogether': 2}]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 출연 영화가 많은 배우 상위 10명을 조회하는 cypher 쿼리\n",
    "cypher_query=\"\"\"\n",
    "MATCH (actor:Person {name: $actor_name})-[:ACTED_IN]->(m:Movie)<-[:ACTED_IN]-(co_actor:Person)\n",
    "WHERE actor <> co_actor\n",
    "RETURN co_actor.name AS CoActor, count(m) AS MoviesTogether\n",
    "ORDER BY MoviesTogether DESC\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query, params={\"actor_name\":\"Tom Hanks\"})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "71205622",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Director': 'Martin Scorsese', 'CollaborationCount': 5},\n",
       " {'Director': 'Baz Luhrmann', 'CollaborationCount': 2},\n",
       " {'Director': 'Jerry Zaks', 'CollaborationCount': 1},\n",
       " {'Director': 'James Cameron', 'CollaborationCount': 1},\n",
       " {'Director': 'Sam Raimi', 'CollaborationCount': 1}]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 배우-감독 협업 관계 분석\n",
    "cypher_query=\"\"\"\n",
    "MATCH (a:Person)-[:ACTED_IN]->(m:Movie)<-[:DIRECTED]-(d:Person) //배우 a가 출연한 영화(m)와 그 영화를 감독한 감독(d)을 찾는 패턴\n",
    "WHERE a.name = $actor_name\n",
    "RETURN d.name AS Director, count(m) AS CollaborationCount\n",
    "ORDER BY CollaborationCount DESC\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query, params={\"actor_name\":\"Leonardo DiCaprio\"})"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "88563c41",
   "metadata": {},
   "source": [
    "### 2.3 그래프 기반 추천 시스템"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "35f04b91",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'RecommendMovie': 'Me You and Five Bucks',\n",
       "  'Rating': 10.0,\n",
       "  'SharedGenres': ['Drama']},\n",
       " {'RecommendMovie': 'Dancer, Texas Pop. 81',\n",
       "  'Rating': 10.0,\n",
       "  'SharedGenres': ['Drama']},\n",
       " {'RecommendMovie': \"One Man's Hero\",\n",
       "  'Rating': 9.3,\n",
       "  'SharedGenres': ['Drama']},\n",
       " {'RecommendMovie': 'The Shawshank Redemption',\n",
       "  'Rating': 8.5,\n",
       "  'SharedGenres': ['Drama']},\n",
       " {'RecommendMovie': 'There Goes My Baby',\n",
       "  'Rating': 8.5,\n",
       "  'SharedGenres': ['Drama']}]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query=\"\"\"\n",
    "MATCH (m:Movie{title: $movie_title})-[:IN_GENRE]->(g:Genre)<-[:IN_GENRE]-(rec:Movie)\n",
    "WHERE m <> rec AND rec.rating > 7.0\n",
    "RETURN  rec.title AS RecommendMovie,\n",
    "        rec.rating AS Rating,\n",
    "        collect(g.name) AS SharedGenres // collect() : 여러 행의 값을 하나의 배열로 수집하는 집계 함수\n",
    "ORDER BY Rating DESC, size(SharedGenres) DESC\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query, params={\"movie_title\": \"Apollo 13\"})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "6f0b7501",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'RecommendedMovie': 'Forrest Gump',\n",
       "  'Rating': 8.2,\n",
       "  'RecommendationsScore': 8,\n",
       "  'SharedGenres': ['Drama'],\n",
       "  'SharedActors': ['Tom Hanks', 'Gary Sinise']},\n",
       " {'RecommendedMovie': 'The Green Mile',\n",
       "  'Rating': 8.2,\n",
       "  'RecommendationsScore': 5,\n",
       "  'SharedGenres': ['Drama'],\n",
       "  'SharedActors': ['Tom Hanks']},\n",
       " {'RecommendedMovie': 'Saving Private Ryan',\n",
       "  'Rating': 7.9,\n",
       "  'RecommendationsScore': 5,\n",
       "  'SharedGenres': ['Drama'],\n",
       "  'SharedActors': ['Tom Hanks']},\n",
       " {'RecommendedMovie': 'The Truman Show',\n",
       "  'Rating': 7.8,\n",
       "  'RecommendationsScore': 5,\n",
       "  'SharedGenres': ['Drama'],\n",
       "  'SharedActors': ['Ed Harris']},\n",
       " {'RecommendedMovie': 'A Beautiful Mind',\n",
       "  'Rating': 7.7,\n",
       "  'RecommendationsScore': 5,\n",
       "  'SharedGenres': ['Drama'],\n",
       "  'SharedActors': ['Ed Harris']}]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 복합 추천 (장르+배우 가중치)\n",
    "cypher_query=\"\"\"\n",
    "MATCH (m:Movie {title: $movie_title})\n",
    "MATCH (rec:Movie) WHERE m <> rec AND rec.rating >7.0\n",
    "OPTIONAL MATCH (m)-[:IN_GENRE]->(g:Genre)<-[:IN_GENRE]-(rec)\n",
    "\n",
    "WITH m, rec, COLLECT(g.name) AS genres\n",
    "OPTIONAL MATCH (m)<-[:ACTED_IN]-(a:Person)-[:ACTED_IN]->(rec)\n",
    "\n",
    "WITH m, rec, genres, COLLECT(a.name) AS actors\n",
    "\n",
    "WITH rec,\n",
    "    size(genres) *2 + size(actors)*3 AS score,\n",
    "    genres,\n",
    "    actors\n",
    "WHERE score > 0\n",
    "RETURN  rec.title AS RecommendedMovie,\n",
    "        rec.rating AS Rating,\n",
    "        score AS RecommendationsScore,\n",
    "        genres AS SharedGenres,\n",
    "        actors AS SharedActors\n",
    "\n",
    "ORDER BY score DESC, Rating DESC\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "graph.query(cypher_query, params={\"movie_title\": \"Apollo 13\"})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4c1b5134",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
